<?php

$langCfg = array(
    'page_title'     => 'Тестовая форма входа на сайт',
    'login'          => 'Вход',
    'registration'   => 'Регистрация',
    'ph_login'       => 'Логин',
    'ph_pass'        => 'Пароль',
    'ph_pass_conf'   => 'Пароль еще раз',
    'ph_fname'       => 'Имя',
    'ph_lname'       => 'Фамилия',
    'ph_photo'       => 'Добавьте Вашу фотографию',
    'b_login'        => 'Войти',
    'b_reg'          => 'Зарегистрироваться',
    'emess'          => array(
        'login'          => 'Вы не ввели логин или пароль',
        'notlogin'       => 'Неверный логин или пароль',
        'reg_login_r'    => 'Поле логин - обязательно к заполнению',
        'reg_login_s'    => 'Логин может содержать только буквы латиницы и цифры',
        'reg_login_l'    => 'Максимальная длина логина - 10 символов',
        'reg_login_o'    => 'Этот логин уже зарегистрирован',
        'reg_pass_r'     => 'Поле пароль - обязательно к заполнению',
        'reg_c_pass'     => 'Пароли не совпадают',
        'reg_fname_r'    => 'Поле имя - обязательно к заполнению',
        'reg_fname_l'    => 'Максимальная длина имени - 30 символов',
        'reg_lname_r'    => 'Поле фамилия - обязательно к заполнению',
        'reg_lname_l'    => 'Максимальная длина фамилии - 30 символов',
        'reg_photo_r'    => 'Вы не добавили фотографию',
        'reg_photo_i'    => 'Можно загружать только jpg, gif и png изображения'
    )
);
